package com.Bill_shuai.guessmusic.data;



public class Const {
	public static final int INDEX_FILE_NAME = 0;
	
	public static final int INDEX_SONG_NAME = 1;
	
	public static final int INDEX_LOAD_DATA_STAGE = 0;
	
	public static final int INDEX_LOAD_DATA_COINS = 1;
	
	public static final int TOTAL_COINS = 100;
	
	public static final String FILE_NAME_SAVE_DATA ="musicData.bat";
	
	public static final String MY_APP_KEY = "z4RBKZ0knXVmKA000VlBV9A2"; 
	
	public static final String SONG_INFO[][] = {
		{"__00001.m4a","南方姑娘"},
		{"__00002.m4a","一块红布"},
		{"__00003.m4a","离别"},
		{"__00004.m4a","给我一个理由忘记"},
		{"__00005.m4a","光辉岁月"},
		{"__00006.m4a","大海"},
		{"__00007.m4a","后来"},
		{"__00008.m4a","你怎么能够"},
		{"__00009.m4a","再见"},
		{"__00010.m4a","老男孩"},
		{"__00011.m4a","征服"},
		{"__00012.m4a","大圈圈"},
		{"__00013.m4a","同桌的你"},
		{"__00014.m4a","自作多情"},
		{"__00015.m4a","传奇"},
		{"__00016.m4a","混子"},
		{"__00017.m4a","这就是爱情"},
		{"__00018.m4a","十年"},
		{"__00019.m4a","从头再来"},
		{"__00020.m4a","记事本"},
		{"__00021.m4a","凌乱的华丽"},
		{"__00022.m4a","童话"},
		{"__00023.m4a","冲动的惩罚"},
		{"__00024.m4a","七里香"},
		{"__00025.m4a","有多少爱可以重来"},
		{"__00026.m4a","脸谱"},
		{"__00027.m4a","那些年"},
		{"__00028.m4a","你怎么舍得我难过"},
		{"__00029.m4a","那一夜"},
		{"__00030.m4a","世外桃源"},
		{"__00031.m4a","童年"},
		{"__00032.m4a","匆匆那年"},
		{"__00033.m4a","舍不得"},
		{"__00034.m4a","等一分钟"},
		{"__00035.m4a","滴答"},
		{"__00036.m4a","龙的传人"},
		{"__00037.m4a","风吹麦浪"},
		{"__00038.m4a","你的背包"},
		{"__00039.m4a","李白"},
		{"__00040.m4a","会呼吸的痛"},
		{"__00041.m4a","残血"},
		{"__00042.m4a","日光倾城"},
		{"__00043.m4a","你那么爱他"},
		{"__00044.m4a","模特"},
		{"__00045.m4a","单身情歌"},
		{"__00046.m4a","冰雨"},
		{"__00047.m4a","粉墨人生"},
		{"__00048.m4a","后来"},
		{"__00049.m4a","相见恨晚"},
		{"__00050.m4a","江南"},
		{"__00051.m4a","突然好想你"},
		{"__00052.m4a","挪威的森林"},
		{"__00053.m4a","小城大事"},
		{"__00054.m4a","白天不懂夜的黑"},
		{"__00055.m4a","鸭梨大"},

	};

}
